# задание 3
# вариант 1
my_list = ['',
           'Зима',
           'Зима',
           'Весна',
           'Весна',
           'Весна',
           'Лето',
           'Лето',
           'Лето',
           'Осень',
           'Осень',
           'Осень',
           'Зима']
month = int(input('Введите месяц:'))
print(my_list[month])

# вариант 2
my_dict = {
    1: 'Зима',
    2: 'Зима',
    3: 'Весна',
    4: 'Весна',
    5: 'Весна',
    6: 'Лето',
    7: 'Лето',
    8: 'Лето',
    9: 'Осень',
    10: 'Осень',
    11: 'Осень',
    12: 'Зима'}
month = int(input('Введите месяц:'))
print(my_dict.get(month))
